package com.mycompany.main;

public class AA_DataType {
	public static void main(String[] args) {
		/*┌─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐ 
		 *│ 문제 
		 *│ 	 다음을 알맞은 자료형에 넣어서 출력 하시오                                           
		 *│ 	 정수 [ 1백		]: 	-128 					,	127                
		 *│ 	 정수 [ 3만2천	]: 	-32768					,	32767                  
		 *│ 	 정수 [ 21억		]: 	-2147483648  			,	2147483647         
		 *│ 	 정수 [ 900경	]: 	-9223372036854775808	,	9223372036854775807    
		 *│ 	 실수 [ 21억		]:	-2147483648.7			,	2147483647.7       
		 *│ 	 실수 [ 900경	]:	-9223372036854775808.7	,	9223372036854775807.7  
		 *└─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘*/
		//	
//		
//			num11 = -128;
//			num12 = 127;
//			
//			num21 = -32768; //3만2천
//			num22 = 32767; //3만2천
//			
//			num31 = -2147483648; //21억
//			num32 = 2147483647; //21억
//			
//			num41 = -9223372036854775808; //900경
//			num42 = 9223372036854775807; //900경
//			
//			num51 = -2147483648.7; //21억 (실수)
//			num52 = 2147483647.7; //21억  (실수)
//			
//			num61 = -9223372036854775808.7; //900경 (실수)
//			num62 = 9223372036854775807.7; //900경 (실수)
//			
//			System.out.println("byte Num1: " + num11);
//			System.out.println("byte Num2: " + num12);
//			System.out.println();
//			System.out.println("short Num1: " + num21);
//			System.out.println("short Num2: " + num22);
//			System.out.println();
//			System.out.println("int Num1: " + num31);
//			System.out.println("int Num2: " + num32);
//			System.out.println();
//			System.out.println("long Num1: " + num41);
//			System.out.println("long Num2: " + num42);
//			System.out.println();
//			System.out.println("float Num1: " + num51);
//			System.out.println("float Num2: " + num52);
//			System.out.println();
//			System.out.println("double Num1: " + num61);
//			System.out.println("double Num2: " + num62);
		
		
		

/*┌─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐ 
 *│ 문제 
 *│ 	 다음을 알맞은 자료형에 넣어서 출력 하시오                                           
 *│ 	 정수 [ 1백		]: 	-128 					,	127                
 *│ 	 정수 [ 3만2천	]: 	-32768					,	32767                  
 *│ 	 정수 [ 21억		]: 	-2147483648  			,	2147483647         
 *│ 	 정수 [ 900경	]: 	-9223372036854775808	,	9223372036854775807    
 *│ 	 실수 [ 21억		]:	-2147483648.7			,	2147483647.7       
 *│ 	 실수 [ 900경	]:	-9223372036854775808.7	,	9223372036854775807.7  
 *└─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘*/
//				
//					num11 = -128;
//					num12 = 127;
//					
//					num21 = -32768; //3만2천
//					num22 = 32767; //3만2천
//					
//					num31 = -2147483648; //21억
//					num32 = 2147483647; //21억
//					
//					num41 = -9223372036854775808; //900경
//					num42 = 9223372036854775807; //900경
//					
//					num51 = -2147483648.7; //21억 (실수)
//					num52 = 2147483647.7; //21억  (실수)
//					
//					num61 = -9223372036854775808.7; //900경 (실수)
//					num62 = 9223372036854775807.7; //900경 (실수)
//					
//					System.out.println("byte Num1: " + num11);
//					System.out.println("byte Num2: " + num12);
//					System.out.println();
//					System.out.println("short Num1: " + num21);
//					System.out.println("short Num2: " + num22);
//					System.out.println();
//					System.out.println("int Num1: " + num31);
//					System.out.println("int Num2: " + num32);
//					System.out.println();
//					System.out.println("long Num1: " + num41);
//					System.out.println("long Num2: " + num42);
//					System.out.println();
//					System.out.println("float Num1: " + num51);
//					System.out.println("float Num2: " + num52);
//					System.out.println();
//					System.out.println("double Num1: " + num61);
//					System.out.println("double Num2: " + num62);




		/*┌─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐ 
		 *│ 답 
		 *│      다음을 알맞은 자료형에 넣어서 출력 하시오                                           
		 *│      정수 [ 1백		]: 	-128 					,	127                
		 *│      정수 [ 3만2천	]: 	-32768					,	32767                  
		 *│      정수 [ 21억		]: 	-2147483648  			,	2147483647         
		 *│      정수 [ 900경	]: 	-9223372036854775808	,	9223372036854775807    
		 *│      실수 [ 21억		]:	-2147483648.7			,	2147483647.7       
		 *│      실수 [ 900경	]:	-9223372036854775808.7	,	9223372036854775807.7  
		 *└─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘*/
		//		
		//			byte num11 = -128;
		//			byte num12 = 127;
		//			
		//			short num21 = -32768; //3만2천
		//			short num22 = 32767; //3만2천
		//			
		//			int num31 = -2147483648; //21억
		//			int num32 = 2147483647; //21억
		//			
		//			long num41 = -9223372036854775808L; //900경
		//			long num42 = 9223372036854775807L; //900경
		//			
		//			float num51 = -2147483648.7f; //21억 (실수)
		//			float num52 = 2147483647.7F; //21억  (실수)
		//			
		//			double num61 = -9223372036854775808.7; //900경 (실수)
		//			double num62 = 9223372036854775807.7; //900경 (실수)
		//			
		//			System.out.println("byte Num1: " + num11);
		//			System.out.println("byte Num2: " + num12);
		//			System.out.println();
		//			System.out.println("short Num1: " + num21);
		//			System.out.println("short Num2: " + num22);
		//			System.out.println();
		//			System.out.println("int Num1: " + num31);
		//			System.out.println("int Num2: " + num32);
		//			System.out.println();
		//			System.out.println("long Num1: " + num41);
		//			System.out.println("long Num2: " + num42);
		//			System.out.println();
		//			System.out.println("float Num1: " + num51);
		//			System.out.println("float Num2: " + num52);
		//			System.out.println();
		//			System.out.println("double Num1: " + num61);
		//			System.out.println("double Num2: " + num62);		
	}
}






