package com.myco.C.payment.A.pay.VO;

public class PayCalculateVO {
	
	/** { 직원정보 } **/
	//이름
	private String name = "";
	//사번
	//주민등록번호
	
	//부서
	//지위
	//직급
	//호봉
	
	/** { 근무정보 } **/
	//입사일
	//퇴사일
	//근무일수
	
	
	/** { 지급 금액 } **/
	//기본급
	//직책수당
	//전문수당
	//항로수당
	//외지수당
	//인상소급분
	//조정수당
	//가족수당
	//근속수당
	//부족보전금
	//기타수당
	//휴일수당
	//공휴수당
	//토요수당
	//평일수당
	//식대
	//교통비
	//연차보상비
	//체력단련비
	//경조금
	

	
	/** { 공제 금액 } **/
	//건강보험
	//고용보험
	//국민연금
	
	//소득세
	//주민세
	
	//노조비
	//제형저축
	//단체보험
	//기타공제
	//주차비
	
	
	/** { 정산금액 금액 } **/
	//제형저축 세액공제
	//소득세 정산
	//주민세 정산
	
}
