<%@ page language="java" contentType="text/html; charset=UTF-8"   pageEncoding="UTF-8"%>




<!-- 
┌────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│ * JSTL문법을 사용하기위한 설정
│     - JSP에서 JSTL문법을 사용하기 위해서는 라이브러리가 있어야 한다.      
│     - 라이브러리를 추가하는 설정이다.      
│     - 최종적으로 meta.jsp에 import된다.       
└────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘ -->
<%@taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>
